import { object, string } from 'yup';

export const registerScheme = object( {
  name: string()
      .min( 2, 'Вкажіть мініімум 2 літери, але не більше 30' )
      .max( 30, 'Вкажіть мініімум 2 літери, але не більше 30' )
      .matches( /^[А-яЁёЇїІіЄєҐґ'\s/A-z\s/\-/_/.]+$/, 'Ім’я має містити українські або англійські літери' )
      .required( 'Вкажіть ваше ім’я' ),
  email: string().email( 'Невірно вказано e-mail' ).required( 'Вкажіть ваш e-mail' ),
  phone: string()
  // .matches(
  //     /^\+]?3?[\s]?8?[\s]?\(?0\d{3}?\)?[\s]?\d{2}[\s|-]?\d{3}[\s|-]?\d{4}$/,
  //     // /^\+]?3?[\s]?8?[\s]?\(?0\d{2}?\)?[\s]?\d{3}[\s|-]?\d{2}[\s|-]?\d{2}$/,
  //     // /^\d{3}?\)?[\s]?\d{3}[\s|-]?\d{2}[\s|-]?\d{2}$/,
  //     // /^\d{3}?\)?[\s]?\d{2}[\s|-]?\d{3}[\s|-]?\d{4}$/,
  //     // /^\+?1?\s*\(?-*\.*(\d{3})\)?\.*-*\s*(\d{3})\.*-*\s*(\d{4})$/,
  //     // /^\d{3}?\)?[\s]?\d{3}[\s|-]?\d{2}[\s|-]?\d{2}$/,
  //     'Невірно вказаний номер',
  // )
      .required( 'Вкажіть ваш номер телефону' ),
  password: string()
      .matches(
          /^.*(?=.{8,})((?=.*[!@#$%^&*()\-_=+{};:,<.>]){1})(?=.*\d)((?=.*[A-Z]){1})((?=.*[a-z]){1}).*$/,
          'Пароль має містити більше 8 символів, велику та малу літеру латиницею, цифри і спеціальний знак',
      )
      .required( 'Пароль обов‘язковий' ),
  capcha: string().required( 'Виконайте перевірку reCAPTCHA' ),
  accept: string().required( 'Політики мають бути погоджені' ),
} );
