const dataSity = [
  {
    id: 1,
    sity: 'Київ',
  },
  {
    id: 2,
    sity: 'Вінниця',
  },
  {
    id: 3,
    sity: 'Луцьк',
  },
  {
    id: 4,
    sity: 'Дніпро',
  },
  {
    id: 5,
    sity: 'Житомир',
  },
  {
    id: 6,
    sity: 'Ужгород',
  },
  {
    id: 7,
    sity: 'Запоріжжя',
  },
  {
    id: 8,
    sity: 'Кропивницький',
  },
  {
    id: 9,
    sity: 'Львів',
  },
  {
    id: 10,
    sity: 'Миколаїв',
  },
  {
    id: 11,
    sity: 'Одеса',
  },
  {
    id: 12,
    sity: 'Полтава',
  },
  {
    id: 13,
    sity: 'Рівне',
  },
  {
    id: 14,
    sity: 'Суми',
  },
  {
    id: 15,
    sity: 'Тернопіль',
  },
  {
    id: 16,
    sity: 'Харків',
  },
  {
    id: 17,
    sity: 'Херсон',
  },
  {
    id: 18,
    sity: 'Черкаси',
  },
  {
    id: 19,
    sity: 'Чернівці',
  },
  {
    id: 20,
    sity: 'Чернігів',
  },
  {
    id: 21,
    sity: 'Івано-Франківськ',
  },
  {
    id: 22,
    sity: 'Ірпень',
  },
  {
    id: 23,
    sity: 'Миргород',
  },
  {
    id: 24,
    sity: 'Мукачево',
  },
  {
    id: 25,
    sity: 'Переяслав',
  },
];

export default dataSity;
